/*
9.  Напишите функцию add, которая бы работала следующим образом add(1)(2)(7)...(n). Количество последовательных визовов неограничено.

Пример:
Number(add(1)(2)); // == 3
Number(add(1)(2)(5)); // == 8
Number(add(1)(2)(-3)(4)); //  == 4
Number(add(1)(2)(3)(4)(-5)); // == 5
*/

/* ******************************************************* */
// SOLUTION

// оголошуємо функцію add, яка приймає число x та повертає нову функцію inner.
const add = (x: number) => {
  // оголошуємо змінну sum, яка містить значення аргументу x.
  let sum: number = x;
  // оголошуэмо функцію inner, яка приймає число y та додає його до змінної sum.
  const inner = (y: number) => {
    sum += y;
    // повертаємо функцію inner()
    return inner;
  };

  // оголошуємо метод valueOf для функції inner, який повертає значення змінної sum.
  // використання методу valueOf дозволить виводи значення функції inner, а не саму функцію.
  inner.valueOf = () => {
    return sum;
  };
  // повераємо функцію inner з методом valueOf.
  return inner;
};

console.log(Number(add(3)(2)));
